Catalogs/бит_си_МеткиСтатей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_си_МеткиСтатей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пиктограмма</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВСодержании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_си_ВыводМеток</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВДопСсылках</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_си_ВыводМеток</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВЗаголовке</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_си_ВыводМеток</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВРезультатахПоиска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_си_ВыводМеток</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_си_МеткиСтатей/Forms/ФормаСпискаУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура - устанавливает текст запроса динамического списка "Список".
// Параметры запроса для обновления отображаемых пиктограмм.
// 
&НаСервере
Процедура ОбновитьПиктограммыВСписке()
	
	ТекстЗапросаСписка = "ВЫБРАТЬ
	                     |	Справочникбит_си_МеткиСтатей.Ссылка,
	                     |	Справочникбит_си_МеткиСтатей.ВерсияДанных,
	                     |	Справочникбит_си_МеткиСтатей.ПометкаУдаления,
	                     |	Справочникбит_си_МеткиСтатей.Предопределенный,
	                     |	Справочникбит_си_МеткиСтатей.Родитель,
	                     |	Справочникбит_си_МеткиСтатей.ЭтоГруппа,
	                     |	Справочникбит_си_МеткиСтатей.Код,
	                     |	Справочникбит_си_МеткиСтатей.Наименование,
	                     |	ВЫРАЗИТЬ(&АдресКартинки КАК СТРОКА(255)) КАК АдресКартинки,
	                     |	Справочникбит_си_МеткиСтатей.Описание,
	                     |	Справочникбит_си_МеткиСтатей.ВыводитьВСодержании,
	                     |	Справочникбит_си_МеткиСтатей.ВыводитьВДопСсылках,
	                     |	Справочникбит_си_МеткиСтатей.ВыводитьВЗаголовке,
	                     |	Справочникбит_си_МеткиСтатей.ВыводитьВРезультатахПоиска
	                     |ИЗ
	                     |	Справочник.бит_си_МеткиСтатей КАК Справочникбит_си_МеткиСтатей";
						 
	АдресСтандартнойКартинки = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.бит_си_МеткаСтатьи, ЭтаФорма.УникальныйИдентификатор);
	
	Выборка = Справочники.бит_си_МеткиСтатей.Выбрать();
	МассивКартинок = Новый Массив();
	ТекстЗапросаКартинки = "ВЫБОР
						   |	КОГДА Справочникбит_си_МеткиСтатей.ЭтоГруппа
						   |		ТОГДА """"";
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		ВремКартинка = Выборка.Пиктограмма.Получить();
		Если ТипЗнч(ВремКартинка) = Тип("ДвоичныеДанные") Тогда
		ИначеЕсли ТипЗнч(ВремКартинка) = Тип("Картинка") Тогда
			Если ВремКартинка.Вид = ВидКартинки.Пустая Тогда
				Продолжить;
			КонецЕсли;
		Иначе
			Продолжить;
		КонецЕсли;
		
		МассивКартинок.Добавить(Новый Структура("Ссылка,
												|АдресКартинки",
												Выборка.Ссылка,
												ПолучитьНавигационнуюСсылку(Выборка.Ссылка, "Пиктограмма")));
		
		ТекстЗапросаКартинки = ТекстЗапросаКартинки + "
													   |	КОГДА Справочникбит_си_МеткиСтатей.Ссылка = &СсылкаДляКартинки" + СокрЛП(МассивКартинок.Количество()) + "
													   |		ТОГДА &АдресКартинки" + СокрЛП(МассивКартинок.Количество());
		
	КонецЦикла;
	
	ТекстЗапросаКартинки = ТекстЗапросаКартинки + "
												   |	ИНАЧЕ &АдресСтандартнойКартинки
												   |КОНЕЦ";
	Список.ТекстЗапроса = СтрЗаменить(ТекстЗапросаСписка,
									  "&АдресКартинки",
									  ТекстЗапросаКартинки);
	Список.Параметры.УстановитьЗначениеПараметра("АдресСтандартнойКартинки", АдресСтандартнойКартинки);
	
	Для Значение = 0 По МассивКартинок.ВГраница() Цикл
		
		Список.Параметры.УстановитьЗначениеПараметра("АдресКартинки" + СокрЛП(Значение + 1), МассивКартинок[Значение].АдресКартинки);
		Список.Параметры.УстановитьЗначениеПараметра("СсылкаДляКартинки" + СокрЛП(Значение + 1), МассивКартинок[Значение].Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры // ОбновитьПиктограммыВСписке()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события "ПриИзменении" таблицы "Список" формы. 
// 
&НаКлиенте
Процедура СписокПриИзменении(Элемент)

	ОбновитьПиктограммыВСписке();
	
КонецПроцедуры // СписокПриИзменении()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
// 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьПиктограммыВСписке();
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти
